docs: update doc with training pipeline
